DAYS_MON = 'Понедельник'
DAYS_TUE = 'Вторник'
DAYS_WED = 'Среда'
DAYS_THU = 'Четверг'
DAYS_FRI = 'Пятница'
DAYS_SAT = 'Суббота'

YES = '✅ Да'
NO = '❌ Нет'

AUTO_TABLE = '🕖 Авторасписание'

START_STUD = 'Я студент!'
START_TEACH = 'Я преподаватель!'
START_ABITUR = 'Я абитуриент!'

MAIN_MENU_TTABLE = '📅 Расписание'

ANSWER = 'Вопросы абитуриентов'

QUESTION = '❓ Задать вопрос'

SETTINGS = '⚙️ Настройки'
TYPE = 'Тип: '
GROUP = 'Группа: '
NAME = 'ФИО: '
ALERTS = 'Напоминания'
CONTACT = 'Обратная связь'
INFO = 'О боте'
DELETE = 'Удалить аккаунт'

BACK = '⬅️ Назад'