from enum import Enum

class Message(Enum):
    M_MainMenu = '0' #Главное меню

    M_Start_Greetings = '1' # Перед началом работы мне нужно узнать о вас немного информации. Давайте определим, к какой группе пользователей вы относитесь
    M_Start_Student = '2' #Хорошо! Идём далее.\nТеперь введи шифр своей группы. Например, КТбо1-6.
    M_Start_Teacher = '3' #Отлично! Продолжим.\nТеперь введи свою фамилию и инициалы. Например, Иванов И. И.\n Это упростит вам и мне работу. Если вы некоректно ввели данные, то некоторые функции будут не доступны. Но ничего страшного, вы сможете изменить их в настройках.
    M_Start_Abiturient = '4' #Записал, этого достаточно
    M_Start_thanks = '5' #Спасибо! <3
    
    M_Clear_Сonfirmation = '6' #Вы действительно хотите, что бы я забыл всю информацию о вас?
    M_Clear_Bye = '7' #До свидания! Чтобы занова начать работу со мной, введите команду /start
    M_Clear_Cancel = '8' #Приятно это слышать! :)

    M_TimeTable_Today = '9' #Сегодня {}.\nВыберите день недели.
    M_TimeTable_NoConection = '10' #Простите, в данный момент нельзя получить расписание. :(
    M_TimeTable_WrongGroup = '11'
    M_TimeTable_NoTable = '12' #Что-то пошло не так или на этот день расписания нет.

    M_Error_Wrong_Input = '13' #Некорректный ввод.\nПовторите попытку.
    M_Error_Wrong_Choice = '14' #Выбери что-то из предложенного!
    M_Error_Somting_Wrong = '15' #Что-то пошло не так
