import redis

r = redis.Redis(db=1, password='QzEcTb123789')

A = {
        '0' : 'Главное меню',
        '1' : 'Перед началом работы мне нужно узнать о вас немного информации. Давайте определим, к какой группе пользователей вы относитесь',
        '2' : 'Хорошо! Идём далее.\nТеперь введи шифр своей группы. Например, КТбо1-6.',
        '3' : 'Отлично! Продолжим.\nТеперь введи свою фамилию и инициалы. Например, Иванов И. И.\n Это упростит вам и мне работу. Если вы некоректно ввели данные, то некоторые функции будут не доступны. Но ничего страшного, вы сможете изменить их в настройках.',
        '4' : 'Записал, этого достаточно',
        '5' : 'Спасибо! <3',
        '6' : 'Вы действительно хотите, что бы я забыл всю информацию о вас?',
        '7' : 'До свидания! Чтобы занова начать работу со мной, введите команду /start',
        '8' : 'Приятно это слышать! :)',
        '9' : 'Сегодня {}.\nВыберите день недели.',
        '10' : 'Простите, в данный момент нельзя получить расписание.',
        '11' : 'Не удалось получить расписание. Возможно, указаны некоректные данные.',
        '12' : 'На этот день расписания нет.',
        '13' : 'Некорректный ввод.\nПовторите попытку.',
        '14' : 'Выбери что-то из предложенного!',
        '15' : 'Что-то пошло не так ~_~'
    }

for i in A.keys():
    r.set(i, A[i])
